CSI API ETABS v1

# cAreaElmGetPoints Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetPoints(
    	string Name,
    	ref int NumberPoints,
    	ref string[] Point
    )

    Function GetPoints (
    	Name As String,
    	ByRef NumberPoints As Integer,
    	ByRef Point As String()
    ) As Integer

    Dim instance As cAreaElm
    Dim Name As String
    Dim NumberPoints As Integer
    Dim Point As String()
    Dim returnValue As Integer

    returnValue = instance.GetPoints(Name,
    	NumberPoints, Point)

    int GetPoints(
    	String^ Name,
    	int% NumberPoints,
    	array<String^>^% Point
    )

    abstract GetPoints :
            Name : string *
            NumberPoints : int byref *
            Point : string[] byref -> int

#### Parameters

Name

    Type: SystemString

NumberPoints

    Type: SystemInt32

Point

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cAreaElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com